
## Plan Result (prod)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_workspace_id[0]
  * azurerm_role_assignment.slack_alerts_monitoring_reader_appinsights[0]
  * azurerm_role_assignment.slack_alerts_monitoring_reader_workspace[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_workspace_id[0] will be created
  + resource "azurerm_key_vault_secret" "app_insights_workspace_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/prl-prod/providers/Microsoft.KeyVault/vaults/prl-prod"
      + name                    = "app-insights-workspace-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "family-private-law"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#prl-tech-notifications"
          + "description"         = "Workspace ID for Azure AD authenticated queries to Application Insights"
          + "environment"         = "production"
          + "managedBy"           = "Private Law"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_role_assignment.slack_alerts_monitoring_reader_appinsights[0] will be created
  + resource "azurerm_role_assignment" "slack_alerts_monitoring_reader_appinsights" {
      + condition_version                = (known after apply)
      + description                      = "Allows slack alerts function app to read Application Insights metadata"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "98ec027e-40cb-49db-92de-6e7454ac5cc9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/prl-prod/providers/Microsoft.Insights/components/prl-appinsights-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.slack_alerts_monitoring_reader_workspace[0] will be created
  + resource "azurerm_role_assignment" "slack_alerts_monitoring_reader_workspace" {
      + condition_version                = (known after apply)
      + description                      = "Allows slack alerts function app to query Application Insights workspace using Azure AD authentication"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "98ec027e-40cb-49db-92de-6e7454ac5cc9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":52,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->